//
//  main.swift
//  homework2
//
//  Created by Nazar Kydyraliev on 21/10/22.
//

import Foundation

//Д/З №2 Система контроля версий GIT. Условные операторы if, else if, switch
//
//№1. Используя функции, условные операторы составить следующую программу прогноза погоды:
//
//При вводе одного из городов в readLine (Бишкек, Чолпон-Ата, Талас, Ош, Джалал-Абад, Нарын, Баткен) выводить в итоге данные о погоде на ближайшие 3 дня в указанном городе
//
print("Прогноз погоды\nВведите город:")
let weather = readLine()!
var bishkek = "Бишкек"
var cholpon = "Чолпон-Ата"
var talas = "Талас"
var osh = "Ош"
var djlal = "Джалал-Абад"
var naryn = "Нарын"
var batken = "Баткен"
func weatherKg(){
    if weather == bishkek{
        print("\(bishkek), погода на три дня:\nСегодня - облачно\nЗавтра - пасмурно\nПослезавтра - ясно")}
    if weather == cholpon{
        print("\(cholpon), погода на три дня:\nСегодня - ясно\nЗавтра - переменная облачность\nПослезавтра - ясно")
    }else if weather == talas{
        print("\(talas), погода на три дня:\nСегодня - ясно\nЗавтра - ясно\nПослезавтра - ясно")
    }else if weather == osh{
        print("\(osh), погода на три дня:\nСегодня - переменная облачность\nЗавтра - ясно\nПослезавтра - облачно")
    }else if weather == djlal{
        print("\(djlal),погода на три дня:\nСегодня - облачно\nЗавтра - пасмурно\nПослезавтра - облачно")
    }else if weather == naryn{
        print("\(naryn), погода на три дня:\nСегодня - дождь\nЗавтра - дождь\nПослезавтра - облачно")
    }else if weather == batken{
        print("\(batken) погода на три дня:\nСегодня - ясно\nЗавтра - дождь\nПослезавтра - пасмурно")
    }else{
        print("Ошибка ввода города")
    }
}

//№2. Используя условные операторы и функции создать программу, которая после ввода 5 наименований продуктов через readLine будет считать итоговую стоимость покупок (со скидкой в 5%)
//
//В итоге должно быть так: (например)
//Ваши товары:
//Кола - 50с
//Кефир - 65с
//Молоко - 40с
//Хлеб - 20с
//Салат - 100с
//
//275с + скидка 13,75c
//Итого: 261,25с
//
//№3. Доработать калькулятор с прошлого урока с помощью условных операторов и соединить всё с readLine (например сначала спрашиваете число, после чего “Какое действие совершить?”, затем второе число и т.д ) (максимум доступно 5 действий). И в итоге выдать итоговый результат используя заранее подготовленные функции для вычислений

